# 6.3 Глоссарий.
glossary = {
    'Тестирование ПО' : '- это проверка между реальным и ожидаемым поведением программы.',
    'Цель тестирования' : '- предоставление актуальной информации о соответствии производимого продукта требованиям.',
    'Жизненный цикл ПО' : '- это период времени, который начинается с момента принятия решения о создания продукта, и заканчивается в момент полного изъятия программы из эксплуатации.',
    'Водопадная модель' : '- данная методология подразумевает последовательное прохождение стадий разработки ПО,\nгде перейти на новую стадию можно только при завершении текущей. Нет возможности сделать шаг назад.\nТестирование начинается после программирования.',
    'Баг' : '- это несоответствие производимого продукта требованиям, прямым, либо косвенным.',
}
for key, value in glossary.items():
    print(f'Определение: {key}\nОтвет:{value}\n')

print('Рестек на JAVA в связи с полученной работой в крупной IT - компании. Good bye Python...')